# **JQ()**

## **函数说明**

从json中提取路径表达式expr的值。

## **函数语法**

```
> JQ(json, expr)
```

```

## **参数释义**

|  参数         | 说明                           |
|---------------|--------------------------------|
| json          | 必需，原始json文本或json列名。 |
| expr          | 必需，用于定位值的路径表达式。 |                           |

## **示例**

```sql
> select jq('{"a":1}','$.a');
+---------------------+
| jq({"a":1},$.a) |
+---------------------+
| 1                   |
+---------------------+

> select jq('[1,2,3]', '$[1]');
+---------------------+
| jq([1,2,3], $[1]) |
+---------------------+
| 2                   |
+---------------------+

> select jq('{"a":1,"b":2}','$.*');
+-------------------------+
| jq({"a":1,"b":2},$.*) |
+-------------------------+
| [1, 2]                  |
+-------------------------+

> select jq('[1,2,3]','$[*]');
+---------------------+
| jq([1,2,3],$[*]) |
+---------------------+
| [1, 2, 3]           |
+---------------------+

> select jq('{"a":[1,2,3,{"a":4}]}','$**.a');
+----------------------------------+
| jq({"a":[1,2,3,{"a":4}]}, $**.a) |
+----------------------------------+
| [[1, 2, 3, {"a": 4}], 4]         |
+----------------------------------+


> drop table if exists t1;
> create table t1(a json, b int);
> insert into t1 values('{"a":1}',1),('{"a":2}',2);
> select jq(a,'$.a') from t1 where b=1;
+-----------------+
| jq(a,$.a)     |
+-----------------+
| 1               |
+-----------------+

> select jq(a,'$.a') from t1;
+-----------------+
| jq(a,$.a)     |
+-----------------+
| 1               |
| 2               |
+-----------------+


```

## 提示

如果查询结果不是单个值，则结果将自动转换为JSON数组。
例子: `select jq('[1,2,3]','$[*]')` 将返回 `[1,2,3]`，而不是 `1,2,3`。但 `select jq('[1,2,3]','$[0]')` 将返回 `1`.