# **AVG**

## **函数说明**

`AVG()`是聚合函数的一种，计算了参数列的算术平均值。


## **函数语法**

``` 
> AVG(expr)
```
## **参数释义**
|  参数   | 说明 |
|  ----  | ----  |
| expr  | 任何数值类型的列的列名 |

## **返回值**
以`Double`类型返回该列的算术平均值。
若输入参数为空，则返回`NaN`值。 

## **示例**



!!! note 提示
    `numbers(N)`是一个用于测试的数值表，仅有一列数据，包含了0至N-1的所有整数。

```sql
> SELECT AVG(*) FROM numbers(3);
+--------+
| avg(*) |
+--------+
|      1 |
+--------+

> SELECT AVG(number) FROM numbers(3);
+-------------+
| avg(number) |
+-------------+
|           1 |
+-------------+

> SELECT AVG(number+1) FROM numbers(3);
+----------------------+
| avg(plus(number, 1)) |
+----------------------+
|                    2 |
+----------------------+

> SELECT AVG(number+1) AS a FROM numbers(3);
+------+
| a    |
+------+
|    2 |
+------+
```
***
